---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AreaBasedLoadData.Current
source: html/6c5c66b9-1c18-a57f-4b71-9ed651834cba.htm
---
# Autodesk.Revit.DB.Electrical.AreaBasedLoadData.Current Property

The current of the area based load .

## Syntax (C#)
```csharp
public double Current { get; }
```